## Reading the data ##

In [2]:
import pandas as pd

In [46]:
diamonds_data = pd.read_excel("diamonds_new.xlsx")
diamonds_data.head()
#head calls out the top 5 rows and .tail() calls out the last 5

   price  carat      cut color clarity  depth  table     x     y     z
0    326   0.23    Ideal     E     SI2   61.5   55.0  3.95  3.98  2.43
1    326   0.21  Premium     E     SI1   59.8   61.0  3.89  3.84  2.31
2    327   0.23     Good     E     VS1   56.9   65.0  4.05  4.07  2.31
3    334   0.29  Premium     I     VS2   62.4   58.0  4.20  4.23  2.63
4    335   0.31     Good     J     SI2   63.3   58.0  4.34  4.35  2.75

In [47]:
diamonds_data["color"].unique

<bound method Series.unique of 0        E
1        E
2        E
3        I
4        J
        ..
53915    D
53916    D
53917    D
53918    H
53919    D
Name: color, Length: 53920, dtype: object>

## Types of Probability ##
#### i. Conditional Probability ####
Qn 1. Total number= 1000
      70% play football= 0.7*1000 =700
      60% play basketball= 0.6*1000 =600
      40% play both= 0.4*1000 =400
      
      P(A/B)= P(AnB)/P(B)

In [48]:
nA = 0.7*1000
nB = 0.6*1000
AnB= 0.4*1000
probability= AnB/nB
print(f"The probability that a student who plays basketball also plays football is {probability}")

The probability that a student who plays basketball also plays football is 0.6666666666666666

Using events

In [49]:
sample_space= {1,2,3,4,5,6}
event_one={1,2,3}
event_two={2,4,3}

In [50]:
joint_probability= len([x for x in event_one if x in event_two])/len(sample_space)
joint_probability

probability_event_two= len(event_two)/len(sample_space)

conditional_probability= joint_probability/probability_event_two
print(f"The conditional probability is {conditional_probability}")

The conditional probability is 0.6666666666666666

Event A: Diamonds with clarity of SI1
Event B: Diamonds with carat greater than 0.5

In [51]:
diamonds_data[["clarity","carat"]]

      clarity  carat
0         SI2   0.23
1         SI1   0.21
2         VS1   0.23
3         VS2   0.29
4         SI2   0.31
...       ...    ...
53915     SI1   0.72
53916     SI1   0.72
53917     SI1   0.70
53918     SI2   0.86
53919     SI2   0.75

[53920 rows x 2 columns]

In [52]:
event_a= diamonds_data[diamonds_data['clarity']=='SI1']
event_b= diamonds_data[diamonds_data['carat']>0.5]

joint_event= diamonds_data[(diamonds_data['clarity']=='SI1') & (diamonds_data['carat']>0.5)]
joint_probability= len(joint_event)/len(diamonds_data)
joint_probability

probability_event_b= len(event_b)/len(diamonds_data)

conditional_probability= joint_probability/probability_event_b
conditional_probability

0.27321826598845517

a. Using the "Student_perfomance.xlsx" dataset, what is the probability of;
      i. A student studying Information_Technology
      ii. A female student studying Computer_Science
      iii. A male student studying Data_Science

In [23]:
Students= pd.read_excel("Student_performance.xlsx") 
Students

,Access_no,gender,age,course,DSC3108,DSC3114,MTH3108,SYE3104
0,123,female,21,Computer_Science,89.0,88.0,72,65
1,415,male,22,Computer_Science,91.0,98.0,88,89
2,321,male,21,Data_Science,73.0,70.0,38,41
3,124,female,21,Information_Technology,30.0,40.0,60,31
4,314,female,22,Computer_Science,70.0,75.0,78,60
5,891,male,21,Information_Technology,25.0,70.0,69,19
6,729,female,22,Data_Science,65.0,80.0,38,43
7,892,female,21,Data_Science,90.0,95.0,92,93
8,545,male,22,NaN,54.0,69.0,78,77
9,718,female,21,Information_Technology,NaN,78.0,79,88
10,390,male,22,Computer_Science,45.0,NaN,79,85

In [11]:
total=Students['course'].count()
total

np.int64(10)

In [12]:
IT=Students[Students['course']=="Information_Technology"]['course'].count()
IT

np.int64(3)

In [13]:
Prob1=IT/total
Prob1

np.float64(0.3)

In [19]:
females=Students[(Students['gender']=="female")&(Students['course']=="Computer_Science")]

jointprob1=len(females)/total
jointprob1

np.float64(0.2)

In [20]:
computer= Students[Students['course']=="Computer_Science"]['course'].count()
computer

prob2=computer/total
prob2

np.float64(0.4)

In [21]:
finalprobability=jointprob1/prob2
finalprobability

np.float64(0.5)